conf/response-prod.xml

REQUEST
<soap:Envelope xmlns:hot="http://TekTravel/HotelBookingApi" xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
        <hot:Credentials UserName="thetravelplaceng" Password="The@99768388"></hot:Credentials>
        <wsa:Action>http://TekTravel/HotelBookingApi/HotelCancel</wsa:Action>
        <wsa:To>https://api.tbotechnology.in/hotelapi_v7/hotelservice.svc</wsa:To>
    </soap:Header>
    <soap:Body>
        <hot:HotelCancelRequest>
            <hot:BookingId>131311</hot:BookingId>
            <hot:RequestType>HotelCancel</hot:RequestType>
            <hot:Remarks>User Cancelled</hot:Remarks>
        </hot:HotelCancelRequest>
    </soap:Body>
</soap:Envelope>


RESPONSE
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing"><s:Header><a:Action s:mustUnderstand="1">http://TekTravel/HotelBookingApi/IHotelService/HotelCancelResponse</a:Action></s:Header><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><HotelCancelResponse xmlns="http://TekTravel/HotelBookingApi"><Status><StatusCode>05</StatusCode><Description>ProcessingErr: No Itinerary exist for this input</Description></Status><BookingId>0</BookingId><CancellationCharge>0</CancellationCharge><RefundAmount>0</RefundAmount><RequestStatus>UnProcessed</RequestStatus></HotelCancelResponse></s:Body></s:Envelope>